app/controllers/links_controller.rb

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "5"]]
---
    def get

        @link = Link.find(params[:id])