app/controllers/user_controller.rb

INSERT INTO "users" ("active", "created_at", "email", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)  [["active", nil], ["created_at", Fri, 18 Oct 2013 22:04:55 UTC +00:00], ["email", nil], ["password_digest", nil], ["updated_at", Fri, 18 Oct 2013 22:04:55 UTC +00:00]]
---
    def create

        email = params[:email]
        password = params[:password]

        @user = User.new({:email=>email, :password => password, :active => 1})

        if @user.save